collaboration_app/app/controllers/api/v1/collaborations_controller.rb

  def index
    collaborations = @note.collaborations.includes(:user)
    render json: {
      collaborations: collaborations.map { |c| collaboration_json(c) }
---
SELECT "collaborations".* FROM "collaborations" WHERE "collaborations"."note_id" = $1  [["note_id", 113]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 265], ["id", 266]]
SELECT "collaborations".* FROM "collaborations" WHERE "collaborations"."note_id" = 6

  def create
    user = User.find_by(email: params[:email])

    unless user
      render json: { error: 'User not found' }, status: :not_found
      return
    end

    if user == @note.owner
      render json: { error: 'Cannot add owner as collaborator' }, status: :unprocessable_entity
      return
    end

    collaboration = @note.collaborations.build(
      user: user,
      role: params[:role] || 'viewer'
    )

    if collaboration.save
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'tes@f.com' LIMIT 1
INSERT INTO "collaborations" ("user_id", "note_id", "role", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 274], ["note_id", 118], ["role", 0], ["created_at", "2025-08-30 15:28:35.469316"], ["updated_at", "2025-08-30 15:28:35.469316"]]

  def update
    begin
      if @collaboration.update(collaboration_params)
---
UPDATE "collaborations" SET "role" = $1, "updated_at" = $2 WHERE "collaborations"."id" = $3  [["role", 0], ["updated_at", "2025-08-30 15:28:35.728544"], ["id", 64]]

  def destroy
    @collaboration.destroy
---
DELETE FROM "collaborations" WHERE "collaborations"."id" = $1  [["id", 68]]

  def find_note
    @note = Note.find(params[:note_id])
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = 6 LIMIT 1

  def find_collaboration
    @collaboration = @note.collaborations.find(params[:id])
---
SELECT "collaborations".* FROM "collaborations" WHERE "collaborations"."note_id" = $1 AND "collaborations"."id" = $2 LIMIT $3  [["note_id", 129], ["id", 68], ["LIMIT", 1]]