collaboration_app/app/controllers/api/v1/notes_controller.rb

  def index
    @notes = current_user.accessible_notes.includes(:owner, :collaborators)
    render_success({ notes: @notes.map { |note| note_json(note) } })
---
SELECT DISTINCT "notes".* FROM "notes" LEFT JOIN collaborations ON notes.id = collaborations.note_id WHERE (notes.owner_id = $1 OR collaborations.user_id = $2)  [[nil, 204], [nil, 204]]
SELECT DISTINCT "notes".* FROM "notes" LEFT JOIN collaborations ON notes.id = collaborations.note_id WHERE (notes.owner_id = 5 OR collaborations.user_id = 5)

  def create
    @note = current_user.owned_notes.build(note_params)

    if @note.save
---
INSERT INTO "notes" ("title", "content", "owner_id", "document_state", "created_at", "updated_at") VALUES ('Untitled Note', '{"type":"doc","content":[]}', 5, '{"version":1,"operations":[]}', '2025-08-30 17:29:49.948342', '2025-08-30 17:29:49.948342') RETURNING "id"

  def update
    if @note.update(note_params)
---
UPDATE "notes" SET "content" = '{"text":"test"}', "updated_at" = '2025-08-30 17:29:58.096004' WHERE "notes"."id" = 6

  def destroy
    if @note.owner == current_user
      @note.destroy
---
DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 240]]

  def set_note
    @note = Note.find(params[:id])
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = 6 LIMIT 1

  def note_json(note)
    {
      id: note.id,
      title: note.title,
      owner: {
        id: note.owner.id,
        name: note.owner.name,
        avatar_url: note.owner.avatar_url
      },
      user_role: note.user_role(current_user),
      collaborators_count: note.collaborators.count,
      updated_at: note.updated_at.iso8601,
      created_at: note.created_at.iso8601
---
SELECT COUNT(*) FROM "users" INNER JOIN "collaborations" ON "users"."id" = "collaborations"."user_id" WHERE "collaborations"."note_id" = 6

  def detailed_note_json(note)
    {
      id: note.id,
      title: note.title,
      content: note.content,
      document_state: note.document_state,
      owner: {
        id: note.owner.id,
        name: note.owner.name,
        email: note.owner.email,
        avatar_url: note.owner.avatar_url
      },
      user_role: note.user_role(current_user),
      collaborators: note.collaborators.map do |user|
---
SELECT "users".* FROM "users" INNER JOIN "collaborations" ON "users"."id" = "collaborations"."user_id" WHERE "collaborations"."note_id" = 6