collaboration_app/app/controllers/api/v1/operations_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 416], ["id", 415]]
SELECT "operations".* FROM "operations" WHERE "operations"."note_id" = $1 AND (timestamp > $2) ORDER BY "operations"."timestamp" ASC  [["note_id", 184], [nil, "2025-08-30 14:33:07"]]
---
  def index
    # Only allow owners and editors to view operations
    user_role = @note.user_role(current_user)
    unless user_role == 'owner' || user_role == 'editor'
      render json: { error: 'Edit permission required' }, status: :forbidden
      return
    end

    begin
      operations = @note.operations.includes(:user).ordered

      if params[:since].present?
        since_time = Time.parse(params[:since])
        operations = operations.where('timestamp > ?', since_time)

INSERT INTO "operations" ("note_id", "user_id", "operation_type", "position", "content", "timestamp", "applied", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    operation = @note.operations.build(operation_params)
    operation.user = current_user

    if operation.save

SELECT "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 190], ["LIMIT", 1]]
---
  def find_note
    @note = Note.find(params[:note_id])