collaboration_app/app/controllers/api/v1/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("email", "name", "avatar_url", "password_digest", "created_at", "updated_at") VALUES ('davidcsetefogel@gmail.com', 'David Csete', NULL, '$2a$12$Xq2dFa9xWxqToC.ZANS1g.zlAyPwdv9gUXC1ZeXkL8k5hT7AwpgGO', '2025-08-30 12:35:24.501739', '2025-08-30 12:35:24.501739') RETURNING "id"

  def show
    user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 165], ["LIMIT", 1]]

  def update
    @user = current_user

    if @user.update(user_update_params)
---
UPDATE "users" SET "name" = $1, "avatar_url" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Updated Name"], ["avatar_url", "https://example.com/new-avatar.jpg"], ["updated_at", "2025-08-30 12:17:29.558192"], ["id", 171]]